/* Дана сторона квадрата a. Найдите его площадь S = a * a.*/
package onePZ;
public class Numb1 {
    public static void main(String []args) {
        int a = 5;
        int S=a*a;
        System.out.println(S);
    }
}
